Revit 2024 API
BuiltInFailures.SketchFailures.DifferentOffsets Property
 Adjacent slope-defining lines must have identical eave heights; the highlighted lines do not. You can use the Align Eaves tool to have the eaves aligned for you.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DifferentOffsets { get; }
Visual Basic
Public Shared ReadOnly Property DifferentOffsets As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DifferentOffsets {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace